benchmarks/cospec_benchmark_results_20250525_165614_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/baseline_0_0_6_math500_output.txt
INFO 05-25 17:11:59 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='math500', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=6.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 500 samples from cache from HuggingFaceH4/cache/math500_facebook/opt-6.7b.json
Split dataset into 50 test samples and 450 training samples
Temperature:  0.0
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 6.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     1666      
Benchmark duration (s):                  300.25    
Total input tokens:                      120158    
Total generated tokens:                  366790    
Request throughput (req/s):              5.55      
Output token throughput (tok/s):         1221.60   
Total Token throughput (tok/s):          1621.79   
---------------Time to First Token----------------
Mean TTFT (ms):                          90.11     
Median TTFT (ms):                        86.72     
P99 TTFT (ms):                           182.09    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          39.16     
Median TPOT (ms):                        39.27     
P99 TPOT (ms):                           47.84     
---------------Inter-token Latency----------------
Mean ITL (ms):                           39.30     
Median ITL (ms):                         37.57     
P99 ITL (ms):                            63.36     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          8702.52   
Median E2EL (ms):                        6470.72   
P99 E2EL (ms):                           33935.10  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 39.55     
Median Token Latency (ms):               39.67     
P99 Token Latency (ms):                  48.51     
==================================================