benchmarks/cospec_benchmark_results_20250525_165614_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/colocation_7_0.3_2_math500_output.txt
INFO 05-26 08:33:55 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='math500', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=5.0, logprobs=None, request_rate=2.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.3, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 500 samples from cache from HuggingFaceH4/cache/math500_facebook/opt-6.7b.json
Split dataset into 50 test samples and 450 training samples
Temperature:  0.3
Running test split to train selective validator...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Don't need to train selective validator
Running full benchmark...
Checking server health at http://127.0.0.1:8000/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 2.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 5.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     596       
Benchmark duration (s):                  302.98    
Total input tokens:                      41741     
Total generated tokens:                  134157    
Request throughput (req/s):              1.97      
Output token throughput (tok/s):         442.80    
Total Token throughput (tok/s):          580.57    
---------------Time to First Token----------------
Mean TTFT (ms):                          118.59    
Median TTFT (ms):                        117.85    
P99 TTFT (ms):                           180.22    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          18.23     
Median TPOT (ms):                        17.18     
P99 TPOT (ms):                           30.61     
---------------Inter-token Latency----------------
Mean ITL (ms):                           65.44     
Median ITL (ms):                         64.70     
P99 ITL (ms):                            89.74     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          3881.71   
Median E2EL (ms):                        3028.09   
P99 E2EL (ms):                           13400.64  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 19.00     
Median Token Latency (ms):               17.94     
P99 Token Latency (ms):                  32.16     
==================================================